[
  {
    "timestamp": "2025-12-29T13:21:24.000Z",
    "entities": "Trust Wallet",
    "topic": "attack hack exploit scam fraud breach leak",
    "eventSummary": "Following a Christmas Day exploit, Trust Wallet has identified 2,596 compromised addresses. The company is currently moving into a verification phase to distinguish legitimate victims from false claims.\nSources:\n- https://cointelegraph.com/news/trust-wallet-verification-phase-false-claims-hack"
  },
  {
    "timestamp": "2025-12-29T12:22:23.000Z",
    "entities": "Mens Den",
    "topic": "attack hack exploit scam fraud breach leak",
    "eventSummary": "US-based entity Mens Den reportedly suffered a data breach. The leaked database allegedly contains user email addresses, password hashes, and personal profile information.\nSources:\n- https://twitter.com/1507666230102138882/status/2005615380694278290"
  },
  {
    "timestamp": "2025-12-29T12:21:07.000Z",
    "entities": "Ubisoft",
    "topic": "attack hack exploit scam fraud breach leak",
    "eventSummary": "Reports indicate that a breach at Ubisoft involving the injection of massive amounts of in-game currency may be exaggerated. While hacker groups claim to have leaked 900 GB of source code and internal documentation, no evidence has been provided to verify these claims.\nSources:\n- https://www.reddit.com/r/cybersecurity/comments/1pyhnld/ubisoft_hack_is_reportedly_blown_way_out_of"
  },
  {
    "timestamp": "2025-12-29T10:47:42.000Z",
    "entities": "Omrania",
    "topic": "attack hack exploit scam fraud breach leak",
    "eventSummary": "The Omrania INC Ransom group claims to have breached Saudi Arabian firm Omrania, allegedly exfiltrating 400 GB of sensitive data. The stolen information reportedly includes confidential documents, client data, financial records, and project drawings.\nSources:\n- https://twitter.com/190389182/status/2005591551020343622"
  },
  {
    "timestamp": "2025-12-29T09:46:33.000Z",
    "entities": "npm",
    "topic": "attack hack exploit scam fraud breach leak",
    "eventSummary": "Attackers utilized 27 npm packages as CDN-hosted phishing lures over a five-month period. These packages mimicked Microsoft sign-in and document-sharing pages to target sales staff at 25 industrial and healthcare companies.\nSources:\n- https://twitter.com/209811713/status/2005576160407863561"
  }
]