{
  "events": [
    {
      "timestamp": "2025-12-27T18:48:09.000Z",
      "entities": "Bank Data Breach via Third-Party Vendor",
      "eventSummary": "Two banks have issued urgent data breach alerts to 69,662 customers following a cyberattack on a third-party vendor.",
      "severity": "High",
      "tags": "breach",
      "source": "https://cryptopanic.com/news/28296934/Two-Banks-Issue-Urgent-Data-Breach-Alerts-Warn-69662-Customers-After-Hacker-Hits-Third-Party-Vendor"
    },
    {
      "timestamp": "2025-12-27T18:32:58.000Z",
      "entities": "Condé Nast & Wired.com Data Leak",
      "eventSummary": "A hacker has claimed a massive data breach affecting 40 million users of Condé Nast and has already leaked 2.3 million records from Wired.com while threatening to release the remaining data.",
      "severity": "High",
      "tags": "leak",
      "source": "https://bsky.app/profile/hackread.bsky.social/post/3mayg3byzls2e"
    },
    {
      "timestamp": "2025-12-27T14:42:36.000Z",
      "entities": "Trust Wallet Chrome Extension Supply Chain Attack",
      "eventSummary": "The Trust Wallet Chrome extension version 2.68 was compromised in a supply chain attack involving malicious code that exfiltrated seed phrases and drained approximately $7 million from users. Trust Wallet has since launched a compensation process for the victims.",
      "severity": "High",
      "tags": "hack",
      "source": "https://cryptoslate.com/how-browser-extensions-expose-your-crypto-to-a-fatal-design-flaw-that-the-industry-ignored-bleeding-713m-in-2025"
    }
  ],
  "overallDayThreatScore": 92,
  "dailyBrief": "Today saw a spike in severe cyber incidents across financial, media, and crypto sectors. Major banks issued breach alerts due to a third-party compromise, Condé Nast faced an unprecedented data leak affecting tens of millions, and Trust Wallet's browser extension suffered a damaging supply chain attack resulting in significant financial loss. The trend highlights escalating risks from third-party integrations and supply chain vulnerabilities, with attackers targeting both personal data and financial assets at scale."
}