{
  "events": [
    {
      "timestamp": "2025-12-02T20:11:51.000Z",
      "entities": "Malicious Unlocker 1.9.2 Software Contains Babylon RAT",
      "eventSummary": "Unlocker 1.9.2 from MajorGeeks was found to contain Babylon RAT, which led to thousands in AWS charges from crypto miners and a compromised PC. The RAT included a keylogger and credential stealer.",
      "severity": "High",
      "tags": "hack",
      "source": "https://www.reddit.com/r/cybersecurity/comments/1pc8uh8/unlocker_from_majorgeeks_contains_babylon_rat"
    },
    {
      "timestamp": "2025-12-02T19:30:32.000Z",
      "entities": "Shai-Hulud NPM Attack Exposes Secrets in GitHub Repositories",
      "eventSummary": "The second Shai-Hulud attack exposed approximately 400,000 raw secrets after infecting hundreds of packages in the NPM (Node Package Manager) registry and publishing stolen data in 30,000 GitHub repositories.",
      "severity": "High",
      "tags": "leak",
      "source": "https://bsky.app/profile/bleepingcomputer.com/post/3m6zn7xtmdh2q"
    },
    {
      "timestamp": "2025-12-02T13:31:02.000Z",
      "entities": "University of Pennsylvania Oracle E-Business Suite Data Breach",
      "eventSummary": "The University of Pennsylvania confirmed a new data breach after attackers stole documents containing personal information from its Oracle E-Business Suite servers in August.",
      "severity": "Medium",
      "tags": "breach",
      "source": "https://bsky.app/profile/bleepingcomputer.com/post/3m6yyjlnjgf2q"
    },
    {
      "timestamp": "2025-12-02T13:14:46.000Z",
      "entities": "Goldfinch Finance User deltatiger.eth Crypto Hack",
      "eventSummary": "Goldfinch Finance user deltatiger.eth was hacked, resulting in $330,000 stolen.",
      "severity": "High",
      "tags": "hack",
      "source": "https://cryptopanic.com/news/27582386/Goldfinch-Finance-user-deltatigereth-hacked-330K-stolen-so-far"
    },
    {
      "timestamp": "2025-12-02T09:32:51.000Z",
      "entities": "Fake Interview Social Engineering Scam Targeting Community",
      "eventSummary": "A scam warning has been issued about fake interviews where impersonators, posing as entities like Deutsche Bank, invite community members to speak on a podcast. This is a targeted social engineering attack designed to compromise security.",
      "severity": "Medium",
      "tags": "scam",
      "source": "https://t.me/CardanoTradingOfficial"
    }
  ],
  "overallDayThreatScore": 87,
  "dailyBrief": "Today's cyber threat landscape was marked by several high-severity incidents, including a malicious software trojan (Babylon RAT) distributed via a popular utility, a large-scale leak of secrets from compromised NPM packages affecting thousands of GitHub repositories, and a major cryptocurrency theft. The University of Pennsylvania experienced a significant data breach, and targeted social engineering scams continue to pose risks. The prevalence of software supply chain attacks and credential theft highlights the need for heightened vigilance and proactive security measures."
}