{
  "events": [
    {
      "timestamp": "2026-01-02T00:00:54.000Z",
      "entities": "Ongoing EVM Chain Wallet Attack",
      "eventSummary": "An ongoing attack across various EVM chains has siphoned over $107,000 from hundreds of wallets in small increments under $2,000 each. The underlying cause of the wallet compromises is currently unknown.",
      "severity": "High",
      "tags": "hack",
      "source": "https://twitter.com/1697387633247150081/status/2006878331656921546"
    },
    {
      "timestamp": "2026-01-01T22:39:43.000Z",
      "entities": "Massive Internal System Data Leak",
      "eventSummary": "Attackers allegedly compromised over 3 million records from multiple internal systems, leaking personal data including names, email addresses, dates of birth, IP addresses, and login IDs.",
      "severity": "High",
      "tags": "leak",
      "source": "https://bsky.app/profile/hackmanac.com/post/3mbff4ev7cj2u"
    },
    {
      "timestamp": "2026-01-01T15:54:30.000Z",
      "entities": "Multiple Threats: AWS Key Flaw, Disney Fine, OceanLotus, Magecart",
      "eventSummary": "A security bulletin identified multiple active threats at the start of 2026, including an AWS key flaw, a fine for Disney, malware operations by OceanLotus, and upgrades to Magecart tactics.",
      "severity": "Medium",
      "tags": "hack",
      "source": "https://twitter.com/209811713/status/2006755921519841745"
    },
    {
      "timestamp": "2026-01-01T07:23:15.000Z",
      "entities": "Binance Customer Support Targeted by Fraud",
      "eventSummary": "Binance has flagged a new fraud tactic specifically designed to target and manipulate customer support services.",
      "severity": "Medium",
      "tags": "fraud",
      "source": "https://cryptopanic.com/news/28416968/Binance-Flags-New-Fraud-Tactic-Aimed-at-Manipulating-Customer-Support"
    },
    {
      "timestamp": "2026-01-01T05:55:43.000Z",
      "entities": "RondoDox Botnet Exploiting Next.js Servers",
      "eventSummary": "The RondoDox botnet is reportedly exploiting a React2Shell vulnerability to breach Next.js servers.",
      "severity": "Medium",
      "tags": "exploit",
      "source": "https://twitter.com/128484298/status/2006605236325200015"
    }
  ],
  "overallDayThreatScore": 85,
  "dailyBrief": "The day saw several high-impact cyber incidents, with a major ongoing attack draining funds from EVM chain wallets and a massive leak of over 3 million records from internal systems. Multiple active threats were identified across major platforms, including vulnerabilities and enhanced malware tactics. Binance flagged targeted fraud on customer support, and a botnet is exploiting a new server vulnerability. The overall risk level is high, with significant concerns around financial theft, personal data exposure, and evolving attack methods."
}