{
  "startDate": "2025-12-12",
  "endDate": "2025-12-18",
  "days": [
    {
      "date": "2025-12-12",
      "events": [
        {
          "timestamp": "2025-12-11T21:55:26.000Z",
          "entities": "Gladinet CentreStack & Triofox RCE vulnerability exploited",
          "eventSummary": "Hackers are exploiting an undocumented vulnerability in the cryptographic algorithm implementation within Gladinet's CentreStack and Triofox products for secure remote file access and sharing, leading to RCE attacks.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://www.bleepingcomputer.com"
        },
        {
          "timestamp": "2025-12-11T21:04:34.000Z",
          "entities": "Yearn Finance smart contract hack and pxETH recovery",
          "eventSummary": "Yearn Finance, a defi yield protocol, suffered its third hack due to bugs in its smart contract. The exploiter drained assets from several pools by minting a large number of yETH tokens and withdrawing corresponding assets. $2.4 million in pxETH, a liquid staking token issued by Redacted Cartel, was recovered after Redacted Cartel burned and reissued the stolen tokens.",
          "severity": "High",
          "tags": "hack",
          "source": "https://web3isgoinggreat.com/single/yearn-finance-hack-3"
        },
        {
          "timestamp": "2025-12-11T05:43:08.000Z",
          "entities": "Atradius & Crédito y Caución client data breach",
          "eventSummary": "The attacker reportedly exfiltrated 950,000 records, including client names, mobile numbers, optional emails, policy tiers, and contract types tied to the Atradius and Crédito y Caución divisions.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m7ossmdwez2c"
        }
      ],
      "overallDayThreatScore": 90,
      "dailyBrief": "Today saw a surge in critical cyber incidents targeting financial, SaaS, and insurance sectors. Hackers exploited a major cryptographic flaw in Gladinet’s CentreStack and Triofox products, resulting in remote code execution vulnerabilities. Yearn Finance suffered another substantial hack due to smart contract bugs, though partial asset recovery was achieved. Additionally, a large-scale data breach at Atradius and Crédito y Caución compromised nearly a million client records. The day reflects escalating risk from both technical exploits and data exfiltration, highlighting urgent needs for improved vulnerability management and incident response."
    },
    {
      "date": "2025-12-13",
      "events": [
        {
          "timestamp": "2025-12-12T21:00:38.000Z",
          "entities": "ZEROBASE Front-End Hack Impacting Users",
          "eventSummary": "A ZEROBASE front-end hack resulted in over 270 users losing more than $240K USDT. Following the attack, Binance Wallet has blocked malicious domains and contracts.",
          "severity": "High",
          "tags": "hack",
          "source": "https://twitter.com/2207129125/status/1999585206261469443"
        },
        {
          "timestamp": "2025-12-12T17:27:30.000Z",
          "entities": "Bitcoin Potential Hijack Investigation",
          "eventSummary": "There are questions about whether Bitcoin has been hijacked.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://cryptopanic.com/news/27898676/Has-Bitcoin-Been-Hijacked"
        },
        {
          "timestamp": "2025-12-12T16:28:41.000Z",
          "entities": "Zerobasezk Frontend Compromise and User Fund Theft",
          "eventSummary": "Hackers compromised the Zerobasezk frontend, stealing over $240K from more than 270 users, including one user who lost 123,597 $USDT. Users are advised to revoke any suspicious contract approvals in their wallets.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptopanic.com/news/27897404/Hackers-compromised-the-zerobasezk-frontend-stealing-funds-from-270-users-totaling-over-240K-One-user-alone-lost-123597-USDT-Please-use-or-other-tools-to-revoke-any-suspicious-or-unnecessary-contract-approvals-in-your-wallet-Stay-safe"
        },
        {
          "timestamp": "2025-12-12T14:19:23.000Z",
          "entities": "Scam Activity Surge on Litecoin",
          "eventSummary": "There are reports of many scammers on Litecoin today.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://t.me/Litecoin"
        },
        {
          "timestamp": "2025-12-12T06:04:39.000Z",
          "entities": "Nepes Corp Data Breach by Qilin Group",
          "eventSummary": "The Qilin hacking group claims to have breached Nepes Corp and exfiltrated 1.5 TB of data. The cyberattack was observed on December 11, 2025.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m7rfpmrkf62n"
        },
        {
          "timestamp": "2025-12-12T02:53:03.000Z",
          "entities": "Microsoft Accounts Hijacked via Consentfix Attack",
          "eventSummary": "New Consentfix Attack Hijacks Microsoft Accounts Via Azure Cli.",
          "severity": "High",
          "tags": "hack",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1pk4kpb/new_consentfix_attack_hijacks_microsoft_accounts"
        }
      ],
      "overallDayThreatScore": 87,
      "dailyBrief": "December 12, 2025 saw a significant uptick in high-impact cyber events, especially targeting cryptocurrency platforms and major corporations. Multiple hacks compromised user funds on ZEROBASE/Zerobasezk, with over $240K USDT stolen and coordinated mitigation efforts by Binance Wallet. Microsoft accounts faced a targeted hijack via Azure CLI, indicating increased risk for enterprise users. Nepes Corp suffered a major breach, losing 1.5 TB of data to the Qilin group. Scam activity surged in the Litecoin community, and concerns about a potential Bitcoin hijack highlight ongoing threats to major digital assets. The overall threat level is elevated, with strong recommendations for vigilance and rapid incident response."
    },
    {
      "date": "2025-12-14",
      "events": [],
      "overallDayThreatScore": 0,
      "dailyBrief": "No cyber events were reported today. The threat landscape appears calm with no incidents noted, suggesting no immediate risks or trends requiring attention."
    },
    {
      "date": "2025-12-15",
      "events": [
        {
          "timestamp": "2025-12-14T12:44:00.000Z",
          "entities": "Discord Admin Account Compromise & Scam",
          "eventSummary": "A user reported losing 5k after clicking a link from an admin on Discord. The admins claimed their accounts were hacked and refused to issue refunds.",
          "severity": "High",
          "tags": "scam",
          "source": "https://t.me/ProfiT_Mafia_Chat"
        },
        {
          "timestamp": "2025-12-14T05:46:19.000Z",
          "entities": "Kyith Telegram Channel Scam Ads Incident",
          "eventSummary": "A user reported that scam ads are being served on Kyith's Telegram channel.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://t.me/sgfinindependence"
        },
        {
          "timestamp": "2025-12-14T01:39:49.000Z",
          "entities": "PayPal Account Hack & Fraudulent Transfers",
          "eventSummary": "A user reported their PayPal account was hacked and used for fraudulent transfers, resulting in a negative balance. PayPal customer service was unhelpful.",
          "severity": "High",
          "tags": "hack",
          "source": "https://www.reddit.com/r/paypal/comments/1pm17qo/someone_hacked_my_account_to_send_money_in_it_and"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "Today's cyber events indicate an elevated threat environment with two high-severity incidents involving major platforms, Discord and PayPal, resulting in direct financial losses and account compromise. Scam activity also persists on Telegram channels, reflecting persistent social engineering risks. The lack of effective response from service providers exacerbates user impact and highlights gaps in incident resolution. Vigilance is advised, particularly regarding admin impersonation and unsolicited messages."
    },
    {
      "date": "2025-12-16",
      "events": [
        {
          "timestamp": "2025-12-15T20:36:50.000Z",
          "entities": "OneInchNetwork Telegram Scam Incident",
          "eventSummary": "A scammer was identified on the OneInchNetwork Telegram channel, with a recommendation to block and report them.",
          "severity": "Low",
          "tags": "scam",
          "source": "https://t.me/OneInchNetwork"
        },
        {
          "timestamp": "2025-12-15T15:30:55.000Z",
          "entities": "React Vulnerability Exploitation on Crypto Platforms",
          "eventSummary": "Hackers are exploiting a React vulnerability on crypto platforms.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/27965932/Hackers-Exploit-React-Vulnerability-on-Crypto-Platforms"
        },
        {
          "timestamp": "2025-12-15T10:38:44.000Z",
          "entities": "Nexo Telegram Channel Scam Observation",
          "eventSummary": "A user on the Nexo French Telegram channel observed and commented on a scam.",
          "severity": "Low",
          "tags": "scam",
          "source": "https://t.me/Nexo_fr"
        },
        {
          "timestamp": "2025-12-15T09:05:52.000Z",
          "entities": "React Server Components CVE-2025-55182 Active Exploitation",
          "eventSummary": "A critical security flaw in React Server Components, identified as CVE-2025-55182, is being actively exploited by threat actors to drain wallets and deploy malware across the crypto industry and all websites using React. Security Alliance urges immediate review of front-end code.",
          "severity": "High",
          "tags": "breach",
          "source": "https://cryptonews.com/news/major-javascript-library-breach-puts-all-crypto-websites-at-risk"
        },
        {
          "timestamp": "2025-12-15T08:58:22.000Z",
          "entities": "React Vulnerability Used for Crypto Wallet Drainers",
          "eventSummary": "Hackers are exploiting a React vulnerability to inject crypto wallet drainers, as warned by security groups.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/27955098/DeFi-News-Hackers-Exploit-React-Vulnerability-to-Inject-Crypto-Wallet-Drainers-Security-Groups-Warn"
        },
        {
          "timestamp": "2025-12-15T08:14:21.000Z",
          "entities": "North Korean Fake Zoom Malware Campaign",
          "eventSummary": "North Korean cybercriminals are using 'fake Zoom' tactics to install malware, stealing victims' sensitive data, including passwords and private keys. Cybersecurity firm Security Alliance (SEAL) warned that it has been tracking \"multiple daily\" such attempts.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptonews.com/news/north-korean-actors-use-fake-zoom-to-drain-crypto-wallets-300m-stolen-already"
        }
      ],
      "overallDayThreatScore": 92,
      "dailyBrief": "Today's cyber landscape was marked by critical exploits targeting the React framework, with multiple high-severity incidents affecting crypto platforms and websites industry-wide. The discovery and active exploitation of CVE-2025-55182 poses a substantial threat, leading to widespread wallet draining and malware deployment. Additional alerts include North Korean threat actors leveraging fake Zoom applications for credential theft and persistent scams on major Telegram channels. The concentration of high-impact technical breaches and targeted attacks signals an elevated risk level, urging immediate defensive review and user vigilance."
    },
    {
      "date": "2025-12-17",
      "events": [
        {
          "timestamp": "2025-12-16T16:53:26.000Z",
          "entities": "Fortinet Products Exploitation",
          "eventSummary": "Hackers are exploiting critical-severity vulnerabilities in multiple Fortinet products to gain unauthorized access to admin accounts and steal system configuration files.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3ma4j7633wu2y"
        },
        {
          "timestamp": "2025-12-16T10:55:25.000Z",
          "entities": "700Credit Data Breach",
          "eventSummary": "A massive data breach at 700Credit exposed personal information of millions of consumers, including SSNs, names, and addresses.",
          "severity": "High",
          "tags": "breach",
          "source": "https://hackread.com/700credit-data-breach-exposing-details-of-5-6-million-consumers"
        },
        {
          "timestamp": "2025-12-16T09:21:41.000Z",
          "entities": "Fiat Scam Continuation",
          "eventSummary": "There are claims about the continuation of a 'fiat scam'.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://t.me/Ripple"
        },
        {
          "timestamp": "2025-12-16T05:45:00.000Z",
          "entities": "React Bug Exploitation",
          "eventSummary": "A new React bug is being exploited to drain tokens, impacting thousands of websites and deploying malware and crypto-mining software.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://www.coindesk.com/tech/2025/12/16/new-react-bug-that-can-drain-all-your-tokens-is-impacting-thousands-of-websites"
        },
        {
          "timestamp": "2025-12-16T05:28:42.000Z",
          "entities": "French Ministry of the Interior Data Breach by BreachForums",
          "eventSummary": "BreachForums claims responsibility for a hack on the French Ministry of the Interior, accessing data of over 16 million individuals and issuing a one-week ultimatum before potential data leaks.",
          "severity": "High",
          "tags": "hack",
          "source": "https://twitter.com/877710712734232576/status/2000800230162190412"
        }
      ],
      "overallDayThreatScore": 92,
      "dailyBrief": "Today saw a significant escalation in cyber threats, with multiple high-impact incidents reported. Critical vulnerabilities in Fortinet products and React software are actively being exploited, affecting both enterprise infrastructure and thousands of websites. Two major breaches—at 700Credit and the French Ministry of the Interior—resulted in the exposure of millions of personal records. Additionally, a persistent scam involving fiat transactions continues to circulate. The convergence of exploits, data breaches, and large-scale attacks indicates an elevated threat landscape requiring urgent defensive measures."
    },
    {
      "date": "2025-12-18",
      "events": [
        {
          "timestamp": "2025-12-17T16:52:06.000Z",
          "entities": "React2Shell Ransomware Exploitation (CVE-2025-55182)",
          "eventSummary": "A ransomware gang exploited the critical React2Shell vulnerability (CVE-2025-55182) to gain initial access to corporate networks and deployed file-encrypting malware in under a minute.",
          "severity": "High",
          "tags": "hack",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3ma72e3vy4y2f"
        },
        {
          "timestamp": "2025-12-17T13:08:38.000Z",
          "entities": "Phantom 3.5 Stealer Malware Campaign",
          "eventSummary": "A blog reveals that Phantom 3.5, a stealer malware, exfiltrates sensitive data from victims using a fake Adobe installer and sophisticated evasion techniques to facilitate identity theft and larger attacks.",
          "severity": "Medium",
          "tags": "fraud",
          "source": "https://twitter.com/877710712734232576/status/2001278364980551790"
        },
        {
          "timestamp": "2025-12-17T11:57:19.000Z",
          "entities": "Devman RaaS Affiliate Chat Leak",
          "eventSummary": "A leak of Devman RaaS internal affiliate chats, victim access, and micromanagement details has been reported, indicating poor operational security.",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://twitter.com/1915706282914271232/status/2001260415335231991"
        },
        {
          "timestamp": "2025-12-17T05:48:57.000Z",
          "entities": "Ribbon Finance $2.7 Million Exploit",
          "eventSummary": "Ribbon Finance suffered a $2.7 million exploit.",
          "severity": "High",
          "tags": "hack",
          "source": "https://www.reddit.com/r/CryptoCurrency/comments/1po7rim/ribbon_finance_suffers_27_million_exploit_plans"
        },
        {
          "timestamp": "2025-12-17T03:54:13.000Z",
          "entities": "Yearn Finance Flash Loan Exploit",
          "eventSummary": "Yearn Finance's legacy v1 smart contract was exploited, resulting in an attacker making off with approximately 103 ETH (~$300,000) through a flash loan to manipulate token prices and withdraw iearn assets.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://web3isgoinggreat.com/single/yearn-finance-exploit-4"
        },
        {
          "timestamp": "2025-12-17T01:58:38.000Z",
          "entities": "Fortinet FortiGate Vulnerability Attack (CVE-2025-59718 & CVE-2025-59719)",
          "eventSummary": "Cybersecurity experts report that threat actors are actively exploiting two newly disclosed vulnerabilities in Fortinet FortiGate devices, utilizing malicious SSO logins and authentication bypasses (CVE-2025-59718 & CVE-2025-59719).",
          "severity": "High",
          "tags": "hack",
          "source": "https://twitter.com/877710712734232576/status/2001109751623508138"
        }
      ],
      "overallDayThreatScore": 88,
      "dailyBrief": "December 17th saw a surge in high-impact cyber events, including critical exploits targeting both corporate networks and major DeFi platforms. Ransomware actors rapidly weaponized a new React2Shell vulnerability, and Fortinet FortiGate devices faced active attacks on fresh flaws. Financial losses were significant, with Ribbon Finance suffering a $2.7 million breach and Yearn Finance losing $300,000 in a sophisticated flash loan exploit. Malware campaigns and leaks, such as Phantom 3.5 and Devman RaaS, highlight ongoing risks from fraud and poor operational security. Overall, the day demonstrates aggressive threat actor tactics, rapid exploitation of new vulnerabilities, and sustained financial targeting—requiring vigilant patching, incident response, and monitoring."
    }
  ]
}