{
  "startDate": "2026-01-04",
  "endDate": "2026-01-10",
  "days": [
    {
      "date": "2026-01-04",
      "events": [
        {
          "timestamp": "2026-01-03T23:02:20.000Z",
          "entities": "MetaMask Phishing Exploit Drains EVM Wallets",
          "eventSummary": "Hundreds of EVM-compatible wallets were drained of over $107,000 in a phishing attack involving a fake MetaMask upgrade email. Security researcher ZachXBT flagged the suspicious activity, which involved victims receiving a New Year themed phishing email that funneled funds into a single address.",
          "severity": "High",
          "tags": "scam",
          "source": "https://cryptoslate.com/hundreds-of-evm-wallets-drained-what-to-check-before-you-update"
        },
        {
          "timestamp": "2026-01-03T17:54:42.000Z",
          "entities": "ShinyHunters Claims Resecurity Breach",
          "eventSummary": "Hacker group ShinyHunters claimed to have breached the US cybersecurity firm Resecurity, allegedly leaking internal system screenshots and employee data. However, Resecurity stated the hackers only accessed a fake honeypot environment and no real data was compromised.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://bsky.app/profile/hackread.bsky.social/post/3mbjutcvtcs26"
        },
        {
          "timestamp": "2026-01-03T16:02:37.000Z",
          "entities": "Android Malware Targets Global Banks",
          "eventSummary": "A major malware attack is reportedly targeting Android users across 60 banks and financial institutions worldwide, resulting in drained bank accounts.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28475986/Hackers-Drain-Android-Users-Bank-Accounts-Target-60-Banks-and-Financial-Institutions-Worldwide-in-Major-Malware-Attack-Report"
        },
        {
          "timestamp": "2026-01-03T10:59:22.000Z",
          "entities": "Cryptocurrency Theft Linked to LastPass Breach",
          "eventSummary": "New cryptocurrency theft attacks have been reported and linked to the historical 2022 LastPass data breach.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://cryptopanic.com/news/28471153/Cryptocurrency-theft-attacks-linked-to-2022-LastPass-breach"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "Today's cyber threat landscape shows an elevated risk level, with high-impact events affecting both crypto and banking sectors. Major phishing and malware attacks have resulted in substantial financial losses for EVM wallet holders and Android banking users. Persistent threats from past breaches, as seen with LastPass, continue to drive cryptocurrency theft. Claims of corporate breaches, like the ShinyHunters-Resecurity incident, highlight ongoing targeting of cybersecurity firms, though the impact was mitigated. Vigilance against phishing, malware, and exploitation of historical data leaks remains critical."
    },
    {
      "date": "2026-01-05",
      "events": [
        {
          "timestamp": "2026-01-04T17:25:31.000Z",
          "entities": "OKX Wallet Radiant Capital Exploit Connection",
          "eventSummary": "Reports indicate that the OKX wallet (formerly OKEx) remains connected to the Radiant Capital aggregator following an exploit.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://t.me/okxofficial_id"
        },
        {
          "timestamp": "2026-01-04T15:05:48.000Z",
          "entities": "Farmacia San Pablo Breach by Qilin Hacking Group",
          "eventSummary": "The Qilin hacking group claims to have breached Farmacia San Pablo, a Mexican wholesale and retail pharmacy chain. The incident was reportedly observed on January 2, 2026, and is currently pending verification.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbm4kqyikr25"
        }
      ],
      "overallDayThreatScore": 72,
      "dailyBrief": "Today's cyber events showcase significant threats in both the cryptocurrency and healthcare sectors. The ongoing exploit affecting OKX wallet via Radiant Capital aggregator raises concerns for digital asset holders, while the claimed breach at Farmacia San Pablo by the Qilin hacking group highlights persistent targeting of retail and healthcare entities. Verification and further monitoring of both incidents are advised, with heightened alert for potential data compromise and operational disruption."
    },
    {
      "date": "2026-01-06",
      "events": [
        {
          "timestamp": "2026-01-05T15:56:06.000Z",
          "entities": "Litecoin Telegram Channel Account Hack",
          "eventSummary": "Multiple reports indicate users on the Litecoin Telegram channel have lost access to their accounts due to hacking.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://t.me/Litecoin"
        },
        {
          "timestamp": "2026-01-05T13:01:12.000Z",
          "entities": "Trust Wallet Chrome Extension Breach & Crypto Scam Risks",
          "eventSummary": "A security recap identifies a breach involving the Trust Wallet Chrome extension alongside other persistent cyber risks such as IoT botnets and crypto scams via fake wallet updates.",
          "severity": "High",
          "tags": "breach",
          "source": "https://twitter.com/209811713/status/2008161863201063290"
        },
        {
          "timestamp": "2026-01-05T09:27:10.000Z",
          "entities": "Major Data Exfiltration Report (186 GB)",
          "eventSummary": "Attackers allegedly exfiltrated 186 GB of data, including employee and agent account details, customer information, policy records, and financial parameters from an unspecified entity.",
          "severity": "High",
          "tags": "leak",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbnzjedaum22"
        },
        {
          "timestamp": "2026-01-05T07:46:09.000Z",
          "entities": "MetaMask 2FA Phishing Scam",
          "eventSummary": "A sophisticated phishing campaign targeting MetaMask users is utilizing a realistic two-factor authentication (2FA) flow to steal wallet recovery phrases. The scam was highlighted by blockchain security firm SlowMist.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://beincrypto.com/metamask-phishing-2fa-scam"
        }
      ],
      "overallDayThreatScore": 84,
      "dailyBrief": "Today's cyber landscape saw two high-severity incidents: a major data exfiltration involving sensitive business and customer records, and a breach of the Trust Wallet Chrome extension accompanied by widespread crypto scams. Additional medium-severity attacks targeted the Litecoin Telegram channel and MetaMask users, highlighting persistent threats in the cryptocurrency space, especially social engineering and phishing. The overall risk remains elevated, with multiple vectors impacting wallet security and user accounts."
    },
    {
      "date": "2026-01-07",
      "events": [
        {
          "timestamp": "2026-01-06T22:37:21.000Z",
          "entities": "Ledger-Trezor Phishing Scam Following Global-e Breach",
          "eventSummary": "Ledger users are being targeted by a phishing campaign featuring a fake merger between Ledger and Trezor. This follows a data breach at Ledger's e-commerce partner, Global-e, which exposed customer contact and order information.",
          "severity": "High",
          "tags": "scam",
          "source": "https://cryptopotato.com/ledger-users-targeted-in-phishing-scam-following-global-e-data-breach"
        },
        {
          "timestamp": "2026-01-06T22:19:10.000Z",
          "entities": "Flow Counterfeit Token Exploit",
          "eventSummary": "Flow released details regarding a December exploit involving counterfeit tokens that resulted in losses totaling $3.9 million.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28563003/Flow-details-December-exploit-that-led-to-39M-in-losses-due-to-counterfeit-tokens"
        },
        {
          "timestamp": "2026-01-06T11:25:02.000Z",
          "entities": "NordVPN Alleged Data Leak Denial",
          "eventSummary": "NordVPN has officially denied claims of a data breach following reports that a hacker leaked company data online.",
          "severity": "Low",
          "tags": "leak",
          "source": "https://twitter.com/41258937/status/2008500050981515388"
        },
        {
          "timestamp": "2026-01-06T10:07:10.000Z",
          "entities": "Multi-Signature Wallet $27.3M PeckShield ETH Laundering",
          "eventSummary": "A hacker successfully exploited a multi-signature wallet to steal approximately $27.3 million, with subsequent reports from PeckShield indicating the attacker is laundering the stolen ETH.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptopanic.com/news/28543090/Hacker-Steals-273M-Using-Multi-Signature-Wallet-Exploit"
        },
        {
          "timestamp": "2026-01-06T03:21:44.000Z",
          "entities": "ClickFix BSOD Malware Attack Campaign",
          "eventSummary": "The ClickFix attack campaign is reportedly utilizing deceptive Windows Blue Screen of Death (BSOD) screens to trick users into installing malware.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://twitter.com/128484298/status/2008378424591630574"
        }
      ],
      "overallDayThreatScore": 90,
      "dailyBrief": "A series of high-impact cyber events occurred today, with major financial losses in the crypto sector and a sophisticated phishing campaign targeting Ledger users after a partner breach. Significant exploits were reported involving Flow and multi-signature wallets, totaling over $31M in losses, while ClickFix used deceptive BSOD screens to spread malware. NordVPN denied an alleged leak, but overall, the day highlights escalating risks in cryptocurrency platforms and advanced social engineering tactics."
    },
    {
      "date": "2026-01-08",
      "events": [
        {
          "timestamp": "2026-01-07T16:00:05.000Z",
          "entities": "Ghost Tap malware drives remote NFC payment fraud",
          "eventSummary": "New Ghost Tap malware is reportedly driving a significant increase in remote NFC payment fraud.",
          "severity": "High",
          "tags": "fraud",
          "source": "https://twitter.com/29415843/status/2008931657701613955"
        },
        {
          "timestamp": "2026-01-07T02:50:53.000Z",
          "entities": "Web Cache Deception vulnerability leads to user data leakage",
          "eventSummary": "A report details how specific cache rules can lead to user data leakage through Web Cache Deception vulnerabilities.",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://twitter.com/1689512391300751362/status/2008733048037068884"
        },
        {
          "timestamp": "2026-01-07T01:37:59.000Z",
          "entities": "ClickFix attack uses fake BSOD screens for malware delivery",
          "eventSummary": "A ClickFix attack method has been identified that utilizes fraudulent Windows Blue Screen of Death (BSOD) screens to trick users into installing malware.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1q5c8yw/clickfix_attack_uses_fake_windows_bsod_screens_to"
        }
      ],
      "overallDayThreatScore": 78,
      "dailyBrief": "Today's cyber landscape shows a worrying trend in sophisticated fraud and scam tactics. The standout threat is the emergence of Ghost Tap malware, which is driving a surge in NFC payment fraud and poses significant risk to financial transactions. Additionally, a Web Cache Deception vulnerability and deceptive malware delivery via fake BSOD screens highlight the ongoing dangers of both data leaks and social engineering. Organizations should reinforce payment security and user education against scams."
    },
    {
      "date": "2026-01-09",
      "events": [
        {
          "timestamp": "2026-01-08T23:59:26.000Z",
          "entities": "China-linked Linux-based Malware Breach at Southeastern Europe Telecom Providers",
          "eventSummary": "A China-linked threat actor using Linux-based malware has breached telecommunications providers in Southeastern Europe by exploiting edge devices.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3mbx5ptw3nq2l"
        },
        {
          "timestamp": "2026-01-08T23:15:54.000Z",
          "entities": "Truebit Protocol $26M ETH Exploit",
          "eventSummary": "Truebit protocol confirmed a security incident involving an exploit that drained over $26 million in ETH.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28641772/Truebit-protocol-confirms-security-incident-as-exploit-drains-over-26m-in-ETH"
        },
        {
          "timestamp": "2026-01-08T17:54:32.000Z",
          "entities": "Qilin Group Breach of Anteriad (3TB Data Exfiltration)",
          "eventSummary": "The Qilin hacking group claims to have breached US-based company Anteriad, allegedly exfiltrating 3.0 TB of data.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbwhbelexy22"
        },
        {
          "timestamp": "2026-01-08T17:54:32.000Z",
          "entities": "Qilin Group Breach of Softlab SpA",
          "eventSummary": "The Qilin hacking group claims to have breached Italian ICT company Softlab SpA.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbwh6tyt7y26"
        },
        {
          "timestamp": "2026-01-08T12:48:41.000Z",
          "entities": "ChatGPT & DeepSeek Vulnerabilities and Malicious AI Extension Leaks",
          "eventSummary": "New vulnerabilities in ChatGPT and malicious Chrome extensions posing as AI tools have been discovered, allegedly spying on over 1 million users and exfiltrating sensitive conversation data.",
          "severity": "High",
          "tags": "leak",
          "source": "https://twitter.com/877710712734232576/status/2009245877949301076"
        },
        {
          "timestamp": "2026-01-08T09:48:40.000Z",
          "entities": "Cisco ISE Patch for Public Exploit",
          "eventSummary": "Cisco has patched a vulnerability in its Identity Service Engine (ISE) and warned of public proof-of-concept exploit code available for use by authenticated attackers.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3mbvndgjhbe2b"
        },
        {
          "timestamp": "2026-01-08T08:47:13.000Z",
          "entities": "Salt Typhoon Cyber Espionage Campaign",
          "eventSummary": "A massive cyber espionage campaign known as Salt Typhoon, attributed to Beijing's intelligence service, has been identified in a series of recent attacks.",
          "severity": "High",
          "tags": "hack",
          "source": "https://bsky.app/profile/financialtimes.com/post/3mbuuze5arl2f"
        },
        {
          "timestamp": "2026-01-08T07:45:39.000Z",
          "entities": "HPE OneView Maximum Severity Vulnerability Exploitation",
          "eventSummary": "CISA flagged a maximum severity vulnerability in HPE OneView that is being actively exploited in attacks.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://twitter.com/50026664/status/2009169616992346409"
        },
        {
          "timestamp": "2026-01-08T05:04:19.000Z",
          "entities": "Smaregi Breach and Leak of 100,000 Customer Records",
          "eventSummary": "The lulzintel threat actor claims to have breached Japanese company Smaregi, allegedly leaking a database containing personal information of 100,000 customers.",
          "severity": "High",
          "tags": "leak",
          "source": "https://twitter.com/190389182/status/2009129012313129157"
        },
        {
          "timestamp": "2026-01-08T05:01:46.000Z",
          "entities": "GoBruteforcer Attacks on Crypto/Blockchain Projects",
          "eventSummary": "A new wave of GoBruteforcer attacks is targeting cryptocurrency and blockchain projects.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://twitter.com/128484298/status/2009128373604188325"
        }
      ],
      "overallDayThreatScore": 92,
      "dailyBrief": "Today's cyber landscape saw a series of high-impact attacks and exploits, including major breaches by nation-state actors and criminal groups targeting telecom, AI platforms, and financial assets. Notably, China-linked groups compromised Southeastern Europe telecom providers using advanced Linux malware, while the Salt Typhoon espionage campaign underscores persistent state-driven threats. Cryptocurrency platforms were hit hard, with Truebit losing $26M to an exploit and GoBruteforcer targeting blockchain projects. Widespread vulnerabilities in popular products (Cisco ISE, HPE OneView, ChatGPT) were actively exploited, while large-scale data leaks affected millions of users, particularly in the AI and retail sectors. The overall threat level is critically high, with coordinated attacks, sophisticated exploits, and significant financial and information losses reported."
    },
    {
      "date": "2026-01-10",
      "events": [
        {
          "timestamp": "2026-01-09T23:59:56.000Z",
          "entities": "Betterment Security Breach Suspected",
          "eventSummary": "Reports have emerged from users indicating that the investment platform Betterment may have suffered a security breach.",
          "severity": "High",
          "tags": "breach",
          "source": "https://www.reddit.com/r/Bitcoin/comments/1q8njyv/betterment_hacked"
        },
        {
          "timestamp": "2026-01-09T16:14:34.000Z",
          "entities": "Condé Nast Massive Data Leak",
          "eventSummary": "A threat actor is reportedly selling 40 million user records belonging to Condé Nast subsidiary websites. This follows a previous leak of 2.3 million Wired.com accounts by the same hacker.",
          "severity": "High",
          "tags": "leak",
          "source": "https://bsky.app/profile/hackread.bsky.social/post/3mbyufof6pk2u"
        },
        {
          "timestamp": "2026-01-09T15:14:44.000Z",
          "entities": "Frontline Fabrics Vendor Email Fraud",
          "eventSummary": "Frontline Fabrics has filed a lawsuit against a unit of Chubb and several banks following an alleged $1.4 million fraud involving a vendor email hack.",
          "severity": "Medium",
          "tags": "fraud",
          "source": "https://www.insurancebusinessmag.com/us/news/legal-insights/frontline-fabrics-sues-chubb-unit-banks-over-alleged-1-4-million-fraud-561537.aspx"
        },
        {
          "timestamp": "2026-01-09T14:12:48.000Z",
          "entities": "Empresas Copec S.A. VPN Breach",
          "eventSummary": "The Anubis hacking group claimed to have breached Empresas Copec S.A. in Chile via a corporate VPN vulnerability, allegedly exfiltrating 6 TB of data despite partial encryption blocking.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbylabyhll2c"
        },
        {
          "timestamp": "2026-01-09T13:11:24.000Z",
          "entities": "Grupo Ruiz Transportation Cyberattack",
          "eventSummary": "The Lynx hacking group claimed a cyberattack against the Spanish transportation company Grupo Ruiz and provided data samples as proof of the breach.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbyihzpswn2s"
        },
        {
          "timestamp": "2026-01-09T10:43:58.000Z",
          "entities": "Epoch Protocol Developer Malware Incident",
          "eventSummary": "A developer at Epoch Protocol lost over $20,000 after running a malicious repository linked to 'contagious interview' malware. The exploit granted attackers root access and leaked environment keys, leading to the drainage of multiple EVM and Solana wallets.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://t.me/leviathan_news"
        },
        {
          "timestamp": "2026-01-09T06:06:08.000Z",
          "entities": "Mutti Manufacturing Breach Claim",
          "eventSummary": "The Cl0p hacking group has claimed a breach against the Italian manufacturing company Mutti. The incident is currently pending verification.",
          "severity": "Low",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbxsbcicex22"
        },
        {
          "timestamp": "2026-01-09T06:06:08.000Z",
          "entities": "Universidade Federal de Sergipe Data Exfiltration",
          "eventSummary": "The Vect hacking group allegedly breached the Universidade Federal de Sergipe in Brazil, exfiltrating 150 GB of data. The stolen information reportedly includes administrative account hashes, student and staff records, medical data, and financial information.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbxqxcf6td2c"
        },
        {
          "timestamp": "2026-01-09T03:08:03.000Z",
          "entities": "Truebit Protocol Smart Contract Exploit",
          "eventSummary": "Truebit Protocol suffered a major security exploit targeting a vulnerability in a five-year-old smart contract, resulting in the theft of approximately 8,500 ETH (valued at $26.5 million). The incident caused the protocol's native token, TRU, to plummet by nearly 100%.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopotato.com/truebit-suffers-26-5m-loss-in-first-major-defi-hack-of-2026"
        }
      ],
      "overallDayThreatScore": 89,
      "dailyBrief": "2026-01-09 saw an elevated level of cyber threats, with multiple high-severity breaches and data leaks reported across financial, media, manufacturing, education, and crypto sectors. Notable events include the suspected Betterment breach, the sale of 40 million Condé Nast user records, a $26.5 million exploit against Truebit Protocol, and significant data exfiltration from Universidade Federal de Sergipe. Ongoing trends highlight persistent targeting of large data stores, financial assets, and supply chain vulnerabilities. Organizations are urged to review VPN, email, and smart contract security controls. Crypto platforms remain high-value targets, with incident severity and financial loss continuing to climb."
    }
  ]
}