{
  "startDate": "2026-01-02",
  "endDate": "2026-01-08",
  "days": [
    {
      "date": "2026-01-02",
      "events": [
        {
          "timestamp": "2026-01-02T00:00:54.000Z",
          "entities": "Ongoing EVM Chain Wallet Attack",
          "eventSummary": "An ongoing attack across various EVM chains has siphoned over $107,000 from hundreds of wallets in small increments under $2,000 each. The underlying cause of the wallet compromises is currently unknown.",
          "severity": "High",
          "tags": "hack",
          "source": "https://twitter.com/1697387633247150081/status/2006878331656921546"
        },
        {
          "timestamp": "2026-01-01T22:39:43.000Z",
          "entities": "Massive Internal System Data Leak",
          "eventSummary": "Attackers allegedly compromised over 3 million records from multiple internal systems, leaking personal data including names, email addresses, dates of birth, IP addresses, and login IDs.",
          "severity": "High",
          "tags": "leak",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbff4ev7cj2u"
        },
        {
          "timestamp": "2026-01-01T15:54:30.000Z",
          "entities": "Multiple Threats: AWS Key Flaw, Disney Fine, OceanLotus, Magecart",
          "eventSummary": "A security bulletin identified multiple active threats at the start of 2026, including an AWS key flaw, a fine for Disney, malware operations by OceanLotus, and upgrades to Magecart tactics.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://twitter.com/209811713/status/2006755921519841745"
        },
        {
          "timestamp": "2026-01-01T07:23:15.000Z",
          "entities": "Binance Customer Support Targeted by Fraud",
          "eventSummary": "Binance has flagged a new fraud tactic specifically designed to target and manipulate customer support services.",
          "severity": "Medium",
          "tags": "fraud",
          "source": "https://cryptopanic.com/news/28416968/Binance-Flags-New-Fraud-Tactic-Aimed-at-Manipulating-Customer-Support"
        },
        {
          "timestamp": "2026-01-01T05:55:43.000Z",
          "entities": "RondoDox Botnet Exploiting Next.js Servers",
          "eventSummary": "The RondoDox botnet is reportedly exploiting a React2Shell vulnerability to breach Next.js servers.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://twitter.com/128484298/status/2006605236325200015"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "The day saw several high-impact cyber incidents, with a major ongoing attack draining funds from EVM chain wallets and a massive leak of over 3 million records from internal systems. Multiple active threats were identified across major platforms, including vulnerabilities and enhanced malware tactics. Binance flagged targeted fraud on customer support, and a botnet is exploiting a new server vulnerability. The overall risk level is high, with significant concerns around financial theft, personal data exposure, and evolving attack methods."
    },
    {
      "date": "2026-01-03",
      "events": [
        {
          "timestamp": "2026-01-02T18:43:11.000Z",
          "entities": "OfferteCartucce Data Breach",
          "eventSummary": "A threat actor known as 888 has claimed a data breach of the Italian e-commerce site OfferteCartucce, allegedly exposing the personal details of 229,000 unique users including tax codes and phone numbers.",
          "severity": "High",
          "tags": "breach",
          "source": "https://twitter.com/1697387633247150081/status/2007160761110671780"
        },
        {
          "timestamp": "2026-01-02T06:35:18.000Z",
          "entities": "Multi-chain Crypto Wallet Draining Exploit",
          "eventSummary": "A multi-chain exploit is currently draining hundreds of crypto wallets across various EVM-compatible blockchains, with reported losses exceeding $107,000. Investigators, including ZachXBT, are working to identify the root cause of the ongoing draining activity.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://beincrypto.com/multi-chain-crypto-wallet-drain-phishing-exploit"
        },
        {
          "timestamp": "2026-01-02T01:38:39.000Z",
          "entities": "RondoDox Botnet Next.js Malware Campaign",
          "eventSummary": "CloudSEK reports that the RondoDox botnet is actively exploiting a critical React2Shell vulnerability (CVE-2025-55182) to install malware and cryptominers on Next.js servers.",
          "severity": "High",
          "tags": "hack",
          "source": "https://twitter.com/877710712734232576/status/2006902927466639716"
        }
      ],
      "overallDayThreatScore": 92,
      "dailyBrief": "Today's cyber events highlight a significant escalation in threats: a major data breach impacting Italian e-commerce users, an ongoing multi-chain exploit draining crypto wallets across EVM blockchains, and a critical vulnerability being actively abused to compromise Next.js servers. All incidents present high severity and impact, indicating an urgent need for heightened security measures and rapid incident response in both finance and tech sectors."
    },
    {
      "date": "2026-01-04",
      "events": [
        {
          "timestamp": "2026-01-03T23:02:20.000Z",
          "entities": "MetaMask Phishing Exploit Drains EVM Wallets",
          "eventSummary": "Hundreds of EVM-compatible wallets were drained of over $107,000 in a phishing attack involving a fake MetaMask upgrade email. Security researcher ZachXBT flagged the suspicious activity, which involved victims receiving a New Year themed phishing email that funneled funds into a single address.",
          "severity": "High",
          "tags": "scam",
          "source": "https://cryptoslate.com/hundreds-of-evm-wallets-drained-what-to-check-before-you-update"
        },
        {
          "timestamp": "2026-01-03T17:54:42.000Z",
          "entities": "ShinyHunters Claims Resecurity Breach",
          "eventSummary": "Hacker group ShinyHunters claimed to have breached the US cybersecurity firm Resecurity, allegedly leaking internal system screenshots and employee data. However, Resecurity stated the hackers only accessed a fake honeypot environment and no real data was compromised.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://bsky.app/profile/hackread.bsky.social/post/3mbjutcvtcs26"
        },
        {
          "timestamp": "2026-01-03T16:02:37.000Z",
          "entities": "Android Malware Targets Global Banks",
          "eventSummary": "A major malware attack is reportedly targeting Android users across 60 banks and financial institutions worldwide, resulting in drained bank accounts.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28475986/Hackers-Drain-Android-Users-Bank-Accounts-Target-60-Banks-and-Financial-Institutions-Worldwide-in-Major-Malware-Attack-Report"
        },
        {
          "timestamp": "2026-01-03T10:59:22.000Z",
          "entities": "Cryptocurrency Theft Linked to LastPass Breach",
          "eventSummary": "New cryptocurrency theft attacks have been reported and linked to the historical 2022 LastPass data breach.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://cryptopanic.com/news/28471153/Cryptocurrency-theft-attacks-linked-to-2022-LastPass-breach"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "Today's cyber threat landscape shows an elevated risk level, with high-impact events affecting both crypto and banking sectors. Major phishing and malware attacks have resulted in substantial financial losses for EVM wallet holders and Android banking users. Persistent threats from past breaches, as seen with LastPass, continue to drive cryptocurrency theft. Claims of corporate breaches, like the ShinyHunters-Resecurity incident, highlight ongoing targeting of cybersecurity firms, though the impact was mitigated. Vigilance against phishing, malware, and exploitation of historical data leaks remains critical."
    },
    {
      "date": "2026-01-05",
      "events": [
        {
          "timestamp": "2026-01-04T17:25:31.000Z",
          "entities": "OKX Wallet Radiant Capital Exploit Connection",
          "eventSummary": "Reports indicate that the OKX wallet (formerly OKEx) remains connected to the Radiant Capital aggregator following an exploit.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://t.me/okxofficial_id"
        },
        {
          "timestamp": "2026-01-04T15:05:48.000Z",
          "entities": "Farmacia San Pablo Breach by Qilin Hacking Group",
          "eventSummary": "The Qilin hacking group claims to have breached Farmacia San Pablo, a Mexican wholesale and retail pharmacy chain. The incident was reportedly observed on January 2, 2026, and is currently pending verification.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbm4kqyikr25"
        }
      ],
      "overallDayThreatScore": 72,
      "dailyBrief": "Today's cyber events showcase significant threats in both the cryptocurrency and healthcare sectors. The ongoing exploit affecting OKX wallet via Radiant Capital aggregator raises concerns for digital asset holders, while the claimed breach at Farmacia San Pablo by the Qilin hacking group highlights persistent targeting of retail and healthcare entities. Verification and further monitoring of both incidents are advised, with heightened alert for potential data compromise and operational disruption."
    },
    {
      "date": "2026-01-06",
      "events": [
        {
          "timestamp": "2026-01-05T15:56:06.000Z",
          "entities": "Litecoin Telegram Channel Account Hack",
          "eventSummary": "Multiple reports indicate users on the Litecoin Telegram channel have lost access to their accounts due to hacking.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://t.me/Litecoin"
        },
        {
          "timestamp": "2026-01-05T13:01:12.000Z",
          "entities": "Trust Wallet Chrome Extension Breach & Crypto Scam Risks",
          "eventSummary": "A security recap identifies a breach involving the Trust Wallet Chrome extension alongside other persistent cyber risks such as IoT botnets and crypto scams via fake wallet updates.",
          "severity": "High",
          "tags": "breach",
          "source": "https://twitter.com/209811713/status/2008161863201063290"
        },
        {
          "timestamp": "2026-01-05T09:27:10.000Z",
          "entities": "Major Data Exfiltration Report (186 GB)",
          "eventSummary": "Attackers allegedly exfiltrated 186 GB of data, including employee and agent account details, customer information, policy records, and financial parameters from an unspecified entity.",
          "severity": "High",
          "tags": "leak",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbnzjedaum22"
        },
        {
          "timestamp": "2026-01-05T07:46:09.000Z",
          "entities": "MetaMask 2FA Phishing Scam",
          "eventSummary": "A sophisticated phishing campaign targeting MetaMask users is utilizing a realistic two-factor authentication (2FA) flow to steal wallet recovery phrases. The scam was highlighted by blockchain security firm SlowMist.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://beincrypto.com/metamask-phishing-2fa-scam"
        }
      ],
      "overallDayThreatScore": 84,
      "dailyBrief": "Today's cyber landscape saw two high-severity incidents: a major data exfiltration involving sensitive business and customer records, and a breach of the Trust Wallet Chrome extension accompanied by widespread crypto scams. Additional medium-severity attacks targeted the Litecoin Telegram channel and MetaMask users, highlighting persistent threats in the cryptocurrency space, especially social engineering and phishing. The overall risk remains elevated, with multiple vectors impacting wallet security and user accounts."
    },
    {
      "date": "2026-01-07",
      "events": [
        {
          "timestamp": "2026-01-06T22:37:21.000Z",
          "entities": "Ledger-Trezor Phishing Scam Following Global-e Breach",
          "eventSummary": "Ledger users are being targeted by a phishing campaign featuring a fake merger between Ledger and Trezor. This follows a data breach at Ledger's e-commerce partner, Global-e, which exposed customer contact and order information.",
          "severity": "High",
          "tags": "scam",
          "source": "https://cryptopotato.com/ledger-users-targeted-in-phishing-scam-following-global-e-data-breach"
        },
        {
          "timestamp": "2026-01-06T22:19:10.000Z",
          "entities": "Flow Counterfeit Token Exploit",
          "eventSummary": "Flow released details regarding a December exploit involving counterfeit tokens that resulted in losses totaling $3.9 million.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28563003/Flow-details-December-exploit-that-led-to-39M-in-losses-due-to-counterfeit-tokens"
        },
        {
          "timestamp": "2026-01-06T11:25:02.000Z",
          "entities": "NordVPN Alleged Data Leak Denial",
          "eventSummary": "NordVPN has officially denied claims of a data breach following reports that a hacker leaked company data online.",
          "severity": "Low",
          "tags": "leak",
          "source": "https://twitter.com/41258937/status/2008500050981515388"
        },
        {
          "timestamp": "2026-01-06T10:07:10.000Z",
          "entities": "Multi-Signature Wallet $27.3M PeckShield ETH Laundering",
          "eventSummary": "A hacker successfully exploited a multi-signature wallet to steal approximately $27.3 million, with subsequent reports from PeckShield indicating the attacker is laundering the stolen ETH.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptopanic.com/news/28543090/Hacker-Steals-273M-Using-Multi-Signature-Wallet-Exploit"
        },
        {
          "timestamp": "2026-01-06T03:21:44.000Z",
          "entities": "ClickFix BSOD Malware Attack Campaign",
          "eventSummary": "The ClickFix attack campaign is reportedly utilizing deceptive Windows Blue Screen of Death (BSOD) screens to trick users into installing malware.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://twitter.com/128484298/status/2008378424591630574"
        }
      ],
      "overallDayThreatScore": 90,
      "dailyBrief": "A series of high-impact cyber events occurred today, with major financial losses in the crypto sector and a sophisticated phishing campaign targeting Ledger users after a partner breach. Significant exploits were reported involving Flow and multi-signature wallets, totaling over $31M in losses, while ClickFix used deceptive BSOD screens to spread malware. NordVPN denied an alleged leak, but overall, the day highlights escalating risks in cryptocurrency platforms and advanced social engineering tactics."
    },
    {
      "date": "2026-01-08",
      "events": [
        {
          "timestamp": "2026-01-07T16:00:05.000Z",
          "entities": "Ghost Tap malware drives remote NFC payment fraud",
          "eventSummary": "New Ghost Tap malware is reportedly driving a significant increase in remote NFC payment fraud.",
          "severity": "High",
          "tags": "fraud",
          "source": "https://twitter.com/29415843/status/2008931657701613955"
        },
        {
          "timestamp": "2026-01-07T02:50:53.000Z",
          "entities": "Web Cache Deception vulnerability leads to user data leakage",
          "eventSummary": "A report details how specific cache rules can lead to user data leakage through Web Cache Deception vulnerabilities.",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://twitter.com/1689512391300751362/status/2008733048037068884"
        },
        {
          "timestamp": "2026-01-07T01:37:59.000Z",
          "entities": "ClickFix attack uses fake BSOD screens for malware delivery",
          "eventSummary": "A ClickFix attack method has been identified that utilizes fraudulent Windows Blue Screen of Death (BSOD) screens to trick users into installing malware.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1q5c8yw/clickfix_attack_uses_fake_windows_bsod_screens_to"
        }
      ],
      "overallDayThreatScore": 78,
      "dailyBrief": "Today's cyber landscape shows a worrying trend in sophisticated fraud and scam tactics. The standout threat is the emergence of Ghost Tap malware, which is driving a surge in NFC payment fraud and poses significant risk to financial transactions. Additionally, a Web Cache Deception vulnerability and deceptive malware delivery via fake BSOD screens highlight the ongoing dangers of both data leaks and social engineering. Organizations should reinforce payment security and user education against scams."
    }
  ]
}