{
  "startDate": "2025-12-30",
  "endDate": "2026-01-05",
  "days": [
    {
      "date": "2025-12-30",
      "events": [
        {
          "timestamp": "2025-12-29T13:21:24.000Z",
          "entities": "Trust Wallet Christmas Day Exploit – 2,596 Addresses Compromised",
          "eventSummary": "Trust Wallet has identified 2,596 compromised addresses after a Christmas Day exploit. The company is currently moving into a verification phase to distinguish legitimate victims from false claims.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cointelegraph.com/news/trust-wallet-verification-phase-false-claims-hack"
        },
        {
          "timestamp": "2025-12-29T12:22:23.000Z",
          "entities": "Mens Den Data Breach – User Information Exposed",
          "eventSummary": "US-based entity Mens Den reportedly suffered a data breach. The leaked database allegedly contains user email addresses, password hashes, and personal profile information.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://twitter.com/1507666230102138882/status/2005615380694278290"
        },
        {
          "timestamp": "2025-12-29T12:21:07.000Z",
          "entities": "Ubisoft Source Code Leak Claims – Unverified",
          "eventSummary": "Reports indicate that a breach at Ubisoft involving the injection of massive amounts of in-game currency may be exaggerated. While hacker groups claim to have leaked 900 GB of source code and internal documentation, no evidence has been provided to verify these claims.",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1pyhnld/ubisoft_hack_is_reportedly_blown_way_out_of"
        },
        {
          "timestamp": "2025-12-29T10:47:42.000Z",
          "entities": "Omrania Ransomware Breach – 400 GB Data Exfiltrated",
          "eventSummary": "The Omrania INC Ransom group claims to have breached Saudi Arabian firm Omrania, allegedly exfiltrating 400 GB of sensitive data. The stolen information reportedly includes confidential documents, client data, financial records, and project drawings.",
          "severity": "High",
          "tags": "breach",
          "source": "https://twitter.com/190389182/status/2005591551020343622"
        },
        {
          "timestamp": "2025-12-29T09:46:33.000Z",
          "entities": "npm Package Phishing Campaign – Industrial & Healthcare Targeted",
          "eventSummary": "Attackers utilized 27 npm packages as CDN-hosted phishing lures over a five-month period. These packages mimicked Microsoft sign-in and document-sharing pages to target sales staff at 25 industrial and healthcare companies.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://twitter.com/209811713/status/2005576160407863561"
        }
      ],
      "overallDayThreatScore": 82,
      "dailyBrief": "A high-threat day with several significant cyber events reported. Trust Wallet and Omrania both suffered high-severity breaches, with thousands of users and large amounts of sensitive data impacted. Ongoing phishing campaigns via npm packages targeted industrial and healthcare sectors, while Mens Den and Ubisoft experienced medium-severity incidents. The volume and diversity of attacks suggest increased activity by threat actors, especially targeting financial, gaming, and critical infrastructure organizations."
    },
    {
      "date": "2025-12-31",
      "events": [
        {
          "timestamp": "2025-12-30T21:19:53.000Z",
          "entities": "ErrTraffic ClickFix Attack Automation Tool",
          "eventSummary": "A new cybercrime tool named ErrTraffic has been identified, allowing threat actors to automate ClickFix attacks by generating fake browser glitches on compromised websites to deliver malicious payloads.",
          "severity": "High",
          "tags": "hack",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3mbab3xcveq2z"
        },
        {
          "timestamp": "2025-12-30T19:37:21.000Z",
          "entities": "Trust Wallet Chrome Extension Exploit Compensation",
          "eventSummary": "Trust Wallet has begun compensating users affected by a security exploit targeting its Chrome browser extension.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28378778/Trust-Wallet-Compensates-Users-After-Chrome-Extension-Exploit"
        },
        {
          "timestamp": "2025-12-30T12:13:29.000Z",
          "entities": "Unleash Protocol Multisig Exploit & Governance Failure",
          "eventSummary": "Unleash Protocol halted all on-chain activities following a multisig exploit and governance failure that led to a hack. Reports indicate the incident is part of a growing trend of DeFi-related scams.",
          "severity": "High",
          "tags": "hack",
          "source": "https://u.today/scam-alert-unleash-protocol-faces-multisig-exploit"
        },
        {
          "timestamp": "2025-12-30T10:48:33.000Z",
          "entities": "Silver Fox ValleyRAT Phishing Operation India",
          "eventSummary": "The threat actor Silver Fox has shifted active phishing operations toward India, utilizing income tax lures to deploy the modular ValleyRAT. The attack leverages DLL sideloading in legitimate Windows software to gain persistent access for credential theft.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://twitter.com/209811713/status/2005954151034019860"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "The day saw a significant spike in targeted cyber attacks and exploits, particularly in the DeFi and browser extension sectors. ErrTraffic introduces a new automated tool for delivering malicious payloads via fake browser glitches, while Unleash Protocol faced a critical multisig exploit, halting all operations. Trust Wallet responded proactively by compensating victims of a Chrome extension breach. Silver Fox's phishing campaign targeting Indian users via ValleyRAT highlights the threat actor’s evolving tactics. The overall threat environment is elevated, with DeFi and credential theft as dominant concerns."
    },
    {
      "date": "2026-01-01",
      "events": [
        {
          "timestamp": "2025-12-31T16:35:53.000Z",
          "entities": "ENSAI student data leak",
          "eventSummary": "A hacker claimed responsibility for a cyberattack on ENSAI (École nationale de la statistique et de l'information), leaking 21 GB of data including profiles of 3,900 students.",
          "severity": "High",
          "tags": "leak",
          "source": "https://twitter.com/1200764024172023808/status/2006403950375842051"
        },
        {
          "timestamp": "2025-12-31T13:34:45.000Z",
          "entities": "Unleash Protocol crypto exploit",
          "eventSummary": "An attacker drained approximately $3.9 million from Unleash Protocol in a cryptocurrency exploit.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptopanic.com/news/28400379/Crypto-Hack-Attacker-Drains-39M-from-Unleash-Protocol"
        },
        {
          "timestamp": "2025-12-31T10:21:35.000Z",
          "entities": "3GH INC ransomware breach",
          "eventSummary": "The 3GH INC Ransom hacking group claims to have breached 3GH, a Spanish ICT sector company, and has provided data samples as proof.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbblmuxcjy27"
        },
        {
          "timestamp": "2025-12-31T02:45:35.000Z",
          "entities": "Hosting provider credential exposure",
          "eventSummary": "Admin credentials were reportedly exposed in source code provided by a hosting provider.",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1pzxfkf/admin_credentials_accidentally_exposed_in_source"
        }
      ],
      "overallDayThreatScore": 87,
      "dailyBrief": "Cyber threats surged today with two high-severity incidents: a major student data leak at ENSAI and a multimillion-dollar crypto exploit targeting Unleash Protocol. Additional breaches include ransomware claims against Spanish firm 3GH INC and exposed admin credentials at a hosting provider. The prevalence of data leaks and financial hacks underscores heightened risks for both organizations and individuals. Vigilance and rapid incident response are strongly advised."
    },
    {
      "date": "2026-01-02",
      "events": [
        {
          "timestamp": "2026-01-02T00:00:54.000Z",
          "entities": "Ongoing EVM Chain Wallet Attack",
          "eventSummary": "An ongoing attack across various EVM chains has siphoned over $107,000 from hundreds of wallets in small increments under $2,000 each. The underlying cause of the wallet compromises is currently unknown.",
          "severity": "High",
          "tags": "hack",
          "source": "https://twitter.com/1697387633247150081/status/2006878331656921546"
        },
        {
          "timestamp": "2026-01-01T22:39:43.000Z",
          "entities": "Massive Internal System Data Leak",
          "eventSummary": "Attackers allegedly compromised over 3 million records from multiple internal systems, leaking personal data including names, email addresses, dates of birth, IP addresses, and login IDs.",
          "severity": "High",
          "tags": "leak",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbff4ev7cj2u"
        },
        {
          "timestamp": "2026-01-01T15:54:30.000Z",
          "entities": "Multiple Threats: AWS Key Flaw, Disney Fine, OceanLotus, Magecart",
          "eventSummary": "A security bulletin identified multiple active threats at the start of 2026, including an AWS key flaw, a fine for Disney, malware operations by OceanLotus, and upgrades to Magecart tactics.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://twitter.com/209811713/status/2006755921519841745"
        },
        {
          "timestamp": "2026-01-01T07:23:15.000Z",
          "entities": "Binance Customer Support Targeted by Fraud",
          "eventSummary": "Binance has flagged a new fraud tactic specifically designed to target and manipulate customer support services.",
          "severity": "Medium",
          "tags": "fraud",
          "source": "https://cryptopanic.com/news/28416968/Binance-Flags-New-Fraud-Tactic-Aimed-at-Manipulating-Customer-Support"
        },
        {
          "timestamp": "2026-01-01T05:55:43.000Z",
          "entities": "RondoDox Botnet Exploiting Next.js Servers",
          "eventSummary": "The RondoDox botnet is reportedly exploiting a React2Shell vulnerability to breach Next.js servers.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://twitter.com/128484298/status/2006605236325200015"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "The day saw several high-impact cyber incidents, with a major ongoing attack draining funds from EVM chain wallets and a massive leak of over 3 million records from internal systems. Multiple active threats were identified across major platforms, including vulnerabilities and enhanced malware tactics. Binance flagged targeted fraud on customer support, and a botnet is exploiting a new server vulnerability. The overall risk level is high, with significant concerns around financial theft, personal data exposure, and evolving attack methods."
    },
    {
      "date": "2026-01-03",
      "events": [
        {
          "timestamp": "2026-01-02T18:43:11.000Z",
          "entities": "OfferteCartucce Data Breach",
          "eventSummary": "A threat actor known as 888 has claimed a data breach of the Italian e-commerce site OfferteCartucce, allegedly exposing the personal details of 229,000 unique users including tax codes and phone numbers.",
          "severity": "High",
          "tags": "breach",
          "source": "https://twitter.com/1697387633247150081/status/2007160761110671780"
        },
        {
          "timestamp": "2026-01-02T06:35:18.000Z",
          "entities": "Multi-chain Crypto Wallet Draining Exploit",
          "eventSummary": "A multi-chain exploit is currently draining hundreds of crypto wallets across various EVM-compatible blockchains, with reported losses exceeding $107,000. Investigators, including ZachXBT, are working to identify the root cause of the ongoing draining activity.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://beincrypto.com/multi-chain-crypto-wallet-drain-phishing-exploit"
        },
        {
          "timestamp": "2026-01-02T01:38:39.000Z",
          "entities": "RondoDox Botnet Next.js Malware Campaign",
          "eventSummary": "CloudSEK reports that the RondoDox botnet is actively exploiting a critical React2Shell vulnerability (CVE-2025-55182) to install malware and cryptominers on Next.js servers.",
          "severity": "High",
          "tags": "hack",
          "source": "https://twitter.com/877710712734232576/status/2006902927466639716"
        }
      ],
      "overallDayThreatScore": 92,
      "dailyBrief": "Today's cyber events highlight a significant escalation in threats: a major data breach impacting Italian e-commerce users, an ongoing multi-chain exploit draining crypto wallets across EVM blockchains, and a critical vulnerability being actively abused to compromise Next.js servers. All incidents present high severity and impact, indicating an urgent need for heightened security measures and rapid incident response in both finance and tech sectors."
    },
    {
      "date": "2026-01-04",
      "events": [
        {
          "timestamp": "2026-01-03T23:02:20.000Z",
          "entities": "MetaMask Phishing Exploit Drains EVM Wallets",
          "eventSummary": "Hundreds of EVM-compatible wallets were drained of over $107,000 in a phishing attack involving a fake MetaMask upgrade email. Security researcher ZachXBT flagged the suspicious activity, which involved victims receiving a New Year themed phishing email that funneled funds into a single address.",
          "severity": "High",
          "tags": "scam",
          "source": "https://cryptoslate.com/hundreds-of-evm-wallets-drained-what-to-check-before-you-update"
        },
        {
          "timestamp": "2026-01-03T17:54:42.000Z",
          "entities": "ShinyHunters Claims Resecurity Breach",
          "eventSummary": "Hacker group ShinyHunters claimed to have breached the US cybersecurity firm Resecurity, allegedly leaking internal system screenshots and employee data. However, Resecurity stated the hackers only accessed a fake honeypot environment and no real data was compromised.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://bsky.app/profile/hackread.bsky.social/post/3mbjutcvtcs26"
        },
        {
          "timestamp": "2026-01-03T16:02:37.000Z",
          "entities": "Android Malware Targets Global Banks",
          "eventSummary": "A major malware attack is reportedly targeting Android users across 60 banks and financial institutions worldwide, resulting in drained bank accounts.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28475986/Hackers-Drain-Android-Users-Bank-Accounts-Target-60-Banks-and-Financial-Institutions-Worldwide-in-Major-Malware-Attack-Report"
        },
        {
          "timestamp": "2026-01-03T10:59:22.000Z",
          "entities": "Cryptocurrency Theft Linked to LastPass Breach",
          "eventSummary": "New cryptocurrency theft attacks have been reported and linked to the historical 2022 LastPass data breach.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://cryptopanic.com/news/28471153/Cryptocurrency-theft-attacks-linked-to-2022-LastPass-breach"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "Today's cyber threat landscape shows an elevated risk level, with high-impact events affecting both crypto and banking sectors. Major phishing and malware attacks have resulted in substantial financial losses for EVM wallet holders and Android banking users. Persistent threats from past breaches, as seen with LastPass, continue to drive cryptocurrency theft. Claims of corporate breaches, like the ShinyHunters-Resecurity incident, highlight ongoing targeting of cybersecurity firms, though the impact was mitigated. Vigilance against phishing, malware, and exploitation of historical data leaks remains critical."
    },
    {
      "date": "2026-01-05",
      "events": [
        {
          "timestamp": "2026-01-04T17:25:31.000Z",
          "entities": "OKX Wallet Radiant Capital Exploit Connection",
          "eventSummary": "Reports indicate that the OKX wallet (formerly OKEx) remains connected to the Radiant Capital aggregator following an exploit.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://t.me/okxofficial_id"
        },
        {
          "timestamp": "2026-01-04T15:05:48.000Z",
          "entities": "Farmacia San Pablo Breach by Qilin Hacking Group",
          "eventSummary": "The Qilin hacking group claims to have breached Farmacia San Pablo, a Mexican wholesale and retail pharmacy chain. The incident was reportedly observed on January 2, 2026, and is currently pending verification.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mbm4kqyikr25"
        }
      ],
      "overallDayThreatScore": 72,
      "dailyBrief": "Today's cyber events showcase significant threats in both the cryptocurrency and healthcare sectors. The ongoing exploit affecting OKX wallet via Radiant Capital aggregator raises concerns for digital asset holders, while the claimed breach at Farmacia San Pablo by the Qilin hacking group highlights persistent targeting of retail and healthcare entities. Verification and further monitoring of both incidents are advised, with heightened alert for potential data compromise and operational disruption."
    }
  ]
}