{
  "startDate": "2025-11-20",
  "endDate": "2025-11-26",
  "days": [
    {
      "date": "2025-11-20",
      "events": [
        {
          "timestamp": "2025-11-19T23:11:30.000Z",
          "entities": "Chrome Zero-Day Exploit Urges Immediate Update",
          "eventSummary": "Attackers are exploiting a zero-day flaw in Chrome, urging users to update Chrome immediately.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1p1ktpe/update_chrome_asap_attackers_are_already/"
        },
        {
          "timestamp": "2025-11-19T08:00:43.000Z",
          "entities": "Largest Documented Phone Number Exposure via Key-Reuse Patterns",
          "eventSummary": "A team warned that scammers or regimes could have exploited a flaw, noting key-reuse patterns suggesting unauthorized clients, and called it the largest documented phone number exposure, though all collected data was deleted.",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m5xpar5umq2s"
        },
        {
          "timestamp": "2025-11-18T00:00:00.000Z",
          "entities": "Municipal Server Breach and Citizen Data Leak",
          "eventSummary": "An actor exploited a third-party server used by a municipality to steal and leak internal documents, and accessed a database containing citizen police records. This incident is pending verification.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m5xm74ynkb2h"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "Today's cyber threat landscape is marked by two high-severity incidents: a zero-day Chrome exploit actively targeted by attackers and a municipal server breach exposing sensitive police records. Additionally, a significant phone number exposure highlights ongoing risks from flawed key management practices. Users should prioritize browser updates and monitor for public sector data leaks, as threat actors are exploiting both software vulnerabilities and misconfigured systems. The overall threat level is elevated, with active exploitation and widespread exposure risks."
    },
    {
      "date": "2025-11-21",
      "events": [
        {
          "timestamp": "2025-11-20T19:26:50.000Z",
          "entities": "Salesforce Customer Data Breach via Gainsight Compromise",
          "eventSummary": "Salesforce is investigating an incident where hackers compromised some of its customers' data after breaching customer experience company Gainsight. The hacking group ShinyHunters has reportedly claimed responsibility.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/lorenzofb.bsky.social/post/3m63iasd24224"
        },
        {
          "timestamp": "2025-11-20T17:01:58.000Z",
          "entities": "Microsoft OS Infostealer Attack Vector",
          "eventSummary": "A Microsoft update has created an agentic OS infostealer attack vector.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1p26ww6/microsoft_update_creates_agentic_os_infostealer/"
        },
        {
          "timestamp": "2025-11-20T09:18:27.000Z",
          "entities": "Beckett Collectibles Data Breach & Website Defacement",
          "eventSummary": "Beckett Collectibles experienced a data breach and website content defacement in November 2025. The stolen data was subsequently advertised for sale on a hacking forum and portions were publicly released.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m62gpwwfou2f"
        },
        {
          "timestamp": "2025-11-20T07:11:07.000Z",
          "entities": "GANA Payment $3.1M+ Crypto Exploit",
          "eventSummary": "The 'GANA Payment' project was exploited for approximately $3.1M+ on BSC. The attacker deposited 1140 BNB ($1.04M) to Tornado on BSC, bridged funds to Ethereum, and deposited another 346.8 ETH ($1.05M) to Tornado. An additional 346 ETH ($1.046M) currently remains dormant on Ethereum at address 0x7a503e3ab9433ebf13afb4f7f1793c25733b3cca.",
          "severity": "High",
          "tags": "exploit",
          "source": ""
        },
        {
          "timestamp": "2025-11-20T05:16:12.000Z",
          "entities": "NAFFCO INC Ransomware Data Exfiltration",
          "eventSummary": "NAFFCO INC was allegedly breached by a ransomware hacking group, which claims to have exfiltrated 1 TB of data including fiscal records, HR files, emails, budgets, strategic plans, and internal documents.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m5zyswmljo2a"
        }
      ],
      "overallDayThreatScore": 87,
      "dailyBrief": "November 20th, 2025 witnessed a series of severe cyber incidents, with multiple high-impact data breaches and exploitation events targeting major organizations and platforms. Salesforce and Beckett Collectibles suffered significant data exposure, while NAFFCO INC faced a large-scale ransomware attack. Notably, the GANA Payment crypto exploit resulted in multimillion-dollar losses and complex laundering activity. Microsoft’s recent update introduced a new infostealer attack vector, highlighting persistent threats to core infrastructure. The day’s events underscore a pronounced trend toward targeted breaches, ransomware, and cryptocurrency exploits, elevating the cyber risk landscape."
    },
    {
      "date": "2025-11-22",
      "events": [
        {
          "timestamp": "2025-11-21T09:37:20.000Z",
          "entities": "Labour Data Exfiltration and Legal File Breach",
          "eventSummary": "Attackers allegedly exfiltrated 200 GB of data, including labour inspection reports, complaints and legal dispute files, and personal email information.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m64xmmrtc72x"
        },
        {
          "timestamp": "2025-11-20T00:00:00.000Z",
          "entities": "Oracle E-Business Suite Zero-day Exploit By Cl0p Group",
          "eventSummary": "The Cl0p hacking group has added 29 more alleged victims to its breach campaign exploiting a Zero-day vulnerability in Oracle E-Business Suite.",
          "severity": "High",
          "tags": "hack",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m64skf64h42x"
        }
      ],
      "overallDayThreatScore": 90,
      "dailyBrief": "Two significant cyber events were reported: a major data exfiltration targeting sensitive labour and legal files, and continued exploitation of a Zero-day vulnerability in Oracle E-Business Suite by the Cl0p group, expanding their victim count. Both incidents highlight sustained, high-severity threats involving large-scale breaches and sophisticated hacking campaigns. Organizations should prioritize patching and enhance data protection measures given these active risks."
    },
    {
      "date": "2025-11-23",
      "events": [
        {
          "timestamp": "2025-11-22T23:48:03.000Z",
          "entities": "Aerodrome Finance DNS Hijack & Frontend Compromise",
          "eventSummary": "Aerodrome Finance is investigating a DNS hijack and frontend compromise targeting Base Ecosystem users.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptopanic.com/news/27308545/Aerodrome-Finance-Investigates-DNS-Hijack-as-Frontend-Compromise-Targets-Base-Ecosystem-Users"
        },
        {
          "timestamp": "2025-11-22T17:59:37.000Z",
          "entities": "Oracle Vulnerability Disclosure & Exploit",
          "eventSummary": "Oracle was reportedly wrong about a vulnerability, which was found after LAPSUS$ posted their exploit on Telegram. Similar issues are noted with SAP and Siemens industrial control systems.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://bsky.app/profile/doublepulsar.com/post/3m6aemyy2rk25"
        },
        {
          "timestamp": "2025-11-22T14:56:47.000Z",
          "entities": "CrowdStrike Insider Threat Incident",
          "eventSummary": "CrowdStrike has identified an insider feeding information to hackers.",
          "severity": "High",
          "tags": "breach",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1p3tac2/crowdstrike_catches_insider_feeding_information/"
        },
        {
          "timestamp": "2025-11-22T14:53:00.000Z",
          "entities": "PayPal, Netflix, TikTok Phishing Scam Campaign",
          "eventSummary": "Hackers are targeting PayPal, Netflix, and TikTok with a new phishing scam.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://cryptopanic.com/news/27301169/Hackers-target-PayPal-Netflix-and-TikTok-with-a-new-phishing-scam"
        },
        {
          "timestamp": "2025-11-22T12:56:59.000Z",
          "entities": "C&M Software DragonForce Data Breach",
          "eventSummary": "The DragonForce hacking group claims to have breached C&M Software in Brazil, allegedly exfiltrating 393.9 GB of data. The ransom deadline is November 29, 2025.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3m67rnr7fn42f"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "This was a high-threat day in cyber risk, with multiple high-severity incidents reported. Aerodrome Finance suffered a DNS hijack and frontend compromise, while C&M Software faced a major breach and ransom demand from DragonForce. CrowdStrike uncovered a dangerous insider threat, raising concerns about internal security. There was also a notable phishing campaign targeting major consumer platforms, and Oracle's vulnerability misjudgment highlighted ongoing risks in industrial systems. The trend shows a mix of targeted attacks on fintech, critical infrastructure, and user platforms, with insider threats and ransomware standing out as top alerts."
    },
    {
      "date": "2025-11-24",
      "events": [
        {
          "timestamp": "2025-11-12T00:00:00.000Z",
          "entities": "SitusAMC Cyberattack Impacting Major Financial Institutions",
          "eventSummary": "SitusAMC, a technology vendor for real estate financiers, suffered a cyberattack on November 12, 2025, potentially exposing client data, including accounting documents and legal contracts, for major clients such as JPMorgan Chase, Citi, and Morgan Stanley. SitusAMC confirmed the breach, alerted law enforcement and the FBI, and reported no impact on banking operations.",
          "severity": "High",
          "tags": "breach",
          "source": "https://www.situsamc.com/databreach"
        }
      ],
      "overallDayThreatScore": 88,
      "dailyBrief": "A significant cyberattack targeted SitusAMC, a key technology vendor for major financial institutions, resulting in a confirmed data breach with possible exposure of sensitive documents. While banking operations remain unaffected, the incident is notable for its impact on high-profile clients such as JPMorgan Chase, Citi, and Morgan Stanley, and highlights ongoing threats to supply chain partners within the financial sector."
    },
    {
      "date": "2025-11-25",
      "events": [
        {
          "timestamp": "2025-11-24T20:45:39.000Z",
          "entities": "SitusAMC Data Breach Impacting Major Banks",
          "eventSummary": "Hackers stole data from SitusAMC, which is used by 1,500 clients including JPMorgan Chase and Citi for real-estate loans and mortgages. This incident has prompted efforts to determine the extent of the data stolen and which banks are affected.",
          "severity": "High",
          "tags": "breach",
          "source": "http://buff.ly/1RA3X4C"
        },
        {
          "timestamp": "2025-11-24T14:39:04.000Z",
          "entities": "Harvard University Alumni Affairs Compromise",
          "eventSummary": "Harvard University disclosed that its Alumni Affairs and Development systems were compromised in a voice phishing attack, exposing personal information of students, alumni, donors, staff, and faculty members.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3m6eyqiouw625"
        },
        {
          "timestamp": "2025-11-24T08:48:55.000Z",
          "entities": "UOB BIN Attack on Card Used at Amazon UAE",
          "eventSummary": "A user reported a fraud transaction on their UOB PPV card for an Amazon UAE purchase, indicating a BIN attack that UOB CSO confirmed has been happening recently. The user has blocked the card and requested a replacement.",
          "severity": "Medium",
          "tags": "fraud",
          "source": "https://t.me/HoneyMoneySG"
        },
        {
          "timestamp": "2025-11-24T04:48:58.000Z",
          "entities": "Coinbase Card Data Hack",
          "eventSummary": "Coinbase Card data was hacked.",
          "severity": "Medium",
          "tags": "hack",
          "source": "https://www.reddit.com/r/CoinBase/comments/1p4t7e0/coinbase_card_data_hacked/"
        }
      ],
      "overallDayThreatScore": 82,
      "dailyBrief": "A significant breach at SitusAMC has exposed sensitive data linked to major financial institutions, elevating today's overall risk. Harvard University reported a targeted voice phishing scam impacting personal information of its community. Financial fraud incidents continue, with UOB cards hit by a BIN attack targeting Amazon UAE purchases. Additionally, Coinbase suffered a hack compromising cardholder data. The day reflects heightened threat activity across financial, academic, and cryptocurrency sectors, with breaches and fraud as dominant patterns."
    },
    {
      "date": "2025-11-26",
      "events": [
        {
          "timestamp": "2025-11-25T22:33:11.000Z",
          "entities": "Scam Exchange Warning",
          "eventSummary": "A user warned about a scam exchange.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://www.reddit.com/r/CoinBase/comments/1p6mhjj/be_careful_with_this_scam_exchange/"
        },
        {
          "timestamp": "2025-11-25T15:10:51.000Z",
          "entities": "Telegram Scammer Identified",
          "eventSummary": "A scammer was identified on Telegram.",
          "severity": "Low",
          "tags": "scam",
          "source": "https://t.me/curvefi"
        },
        {
          "timestamp": "2025-11-25T11:56:10.000Z",
          "entities": "Dartmouth College Data Breach (Clop Gang)",
          "eventSummary": "Dartmouth College disclosed a data breach after the Clop extortion gang leaked data allegedly stolen from the school's Oracle E-Business Suite servers.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3m6h7hq7pcs24"
        },
        {
          "timestamp": "2025-11-25T07:33:13.000Z",
          "entities": "P2P Trade Scam Report",
          "eventSummary": "A user reported being scammed on a P2P trade.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://www.reddit.com/r/binance/comments/1p65eed/getting_scammed_on_a_p2p_trade/"
        }
      ],
      "overallDayThreatScore": 73,
      "dailyBrief": "The day saw a significant security event with Dartmouth College suffering a data breach involving the Clop extortion gang, which poses a substantial risk to sensitive data. Multiple scam incidents were reported, including warnings about fraudulent exchanges, a scammer identified on Telegram, and a P2P trade scam, highlighting ongoing threats in both crypto and social platforms. The overall threat level is elevated, and vigilance is advised especially around scams and reported data breaches."
    }
  ]
}