{
  "startDate": "2025-12-25",
  "endDate": "2025-12-31",
  "days": [
    {
      "date": "2025-12-25",
      "events": [
        {
          "timestamp": "2025-12-24T09:33:58.000Z",
          "entities": "Cryptocurrency Sector Losses Exceed $3.35 Billion",
          "eventSummary": "A report from CertiK indicates that total losses from hacks, exploits, and scams in the cryptocurrency sector exceeded $3.35 billion this year.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptopanic.com/news/28232092/ALERT-Losses-from-hacks-exploits-and-scams-topped-335B-this-year-per-CertiK"
        },
        {
          "timestamp": "2025-12-24T08:33:18.000Z",
          "entities": "Polymarket User Account Breach via Third-Party Authentication",
          "eventSummary": "Polymarket users reported account breaches linked to a third-party authentication vulnerability.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://cryptopanic.com/news/28230542/Polymarket-cites-third-party-vulnerability-in-recent-user-account-hack"
        },
        {
          "timestamp": "2025-12-24T07:35:07.000Z",
          "entities": "SantaStealer Malware Targets Crypto and Browser Data",
          "eventSummary": "A new malware identified as SantaStealer is reportedly targeting and stealing data from web browsers and cryptocurrency wallets.",
          "severity": "High",
          "tags": "hack",
          "source": "https://www.reddit.com/r/CryptoCurrency/comments/1pu35zm/new_santastealer_malware_steals_data_from"
        },
        {
          "timestamp": "2025-12-24T06:34:23.000Z",
          "entities": "Gnosis Hard Fork to Recover $116M from Balancer Exploit",
          "eventSummary": "Gnosis executed a hard fork to recover funds following a November exploit of Balancer that resulted in $116M in stolen digital assets.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28227241/LATEST-Gnosis-executed-a-hard-fork-on-Monday-to-recover-funds-from-a-November-Balancer-exploit-that-saw-116M-in-digital-assets-stolen-with-the-funds-now-out-of-the-hackers-control"
        },
        {
          "timestamp": "2025-12-24T04:51:03.000Z",
          "entities": "University of Phoenix Data Breach Impacts 3.5 Million",
          "eventSummary": "The University of Phoenix confirmed a data breach affecting 3.5 million individuals, stemming from a zero-day vulnerability exploit in Oracle EBS enterprise software attributed to threat groups Cl0p or FIN11.",
          "severity": "High",
          "tags": "breach",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1pude2k/35_million_affected_by_university_of_phoenix_data"
        },
        {
          "timestamp": "2025-12-23T00:00:00.000Z",
          "entities": "OMNIBUS JAPAN INC. Breach Claimed by Lynx Group",
          "eventSummary": "The Lynx hacking group claimed to have breached OMNIBUS JAPAN INC., a Japanese news and multimedia company. The incident is currently pending verification.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mapuwmusa62q"
        }
      ],
      "overallDayThreatScore": 92,
      "dailyBrief": "Today's cyber landscape is marked by multiple high-severity incidents, including major data breaches, sophisticated exploits, and large-scale financial losses. The cryptocurrency sector faces significant threats with over $3.35 billion lost to malicious activities and the emergence of new malware targeting wallet and browser data. Institutions such as the University of Phoenix and Polymarket have suffered breaches due to advanced vulnerabilities, and a major hard fork was executed to recover stolen assets. The high volume and impact of these events signal elevated risk levels, with ongoing threats from advanced persistent groups and novel attack vectors."
    },
    {
      "date": "2025-12-26",
      "events": [
        {
          "timestamp": "2025-12-25T20:02:34.000Z",
          "entities": "Trust Wallet Extension Compromise",
          "eventSummary": "Reports indicate that the Trust Wallet browser extension was compromised, leading to the unauthorized draining of user funds. Preliminary observations suggest the incident may be linked to a Chrome extension update released recently, with estimated losses around $6 million.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptopanic.com/news/28256304/Trust-browser-extension-was-hacked"
        },
        {
          "timestamp": "2025-12-25T14:04:10.000Z",
          "entities": "Emerging Cyber Threats Report",
          "eventSummary": "A security bulletin reports shifting cyber threat tactics, including data leak vulnerabilities in AI chatbots and Docker prompt injection exploits. Other highlighted risks include stealthy loaders, Android NFC malware, and fake Proof of Concepts (PoCs).",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://twitter.com/209811713/status/2004191442848436632"
        }
      ],
      "overallDayThreatScore": 83,
      "dailyBrief": "A major breach affected Trust Wallet users through a compromised browser extension, resulting in significant financial losses. Additionally, a security report highlights evolving tactics targeting AI, container environments, and mobile platforms, emphasizing the rise of data leaks and sophisticated exploits. The day's risks reflect an elevated threat landscape, with critical alerts for both large-scale hacks and emerging vulnerabilities."
    },
    {
      "date": "2025-12-27",
      "events": [
        {
          "timestamp": "2025-12-26T03:41:44.000Z",
          "entities": "Trust Wallet Chrome Extension Security Breach",
          "eventSummary": "Trust Wallet reported a security breach affecting its Chrome browser extension (version 2.68.0), resulting in approximately $7 million in user funds being drained. The team is investigating how a malicious version was submitted, while confirming that affected user funds will be covered.",
          "severity": "High",
          "tags": "breach",
          "source": "https://twitter.com/902926941413453824/status/2004397190819783013"
        }
      ],
      "overallDayThreatScore": 90,
      "dailyBrief": "A significant security breach was reported involving Trust Wallet's Chrome extension, resulting in the theft of approximately $7 million in user funds. The incident highlights the critical risks associated with browser extension vulnerabilities and the importance of rapid response and user fund protection. Users are advised to monitor updates and practice heightened vigilance."
    },
    {
      "date": "2025-12-28",
      "events": [
        {
          "timestamp": "2025-12-27T18:48:09.000Z",
          "entities": "Bank Data Breach via Third-Party Vendor",
          "eventSummary": "Two banks have issued urgent data breach alerts to 69,662 customers following a cyberattack on a third-party vendor.",
          "severity": "High",
          "tags": "breach",
          "source": "https://cryptopanic.com/news/28296934/Two-Banks-Issue-Urgent-Data-Breach-Alerts-Warn-69662-Customers-After-Hacker-Hits-Third-Party-Vendor"
        },
        {
          "timestamp": "2025-12-27T18:32:58.000Z",
          "entities": "Condé Nast & Wired.com Data Leak",
          "eventSummary": "A hacker has claimed a massive data breach affecting 40 million users of Condé Nast and has already leaked 2.3 million records from Wired.com while threatening to release the remaining data.",
          "severity": "High",
          "tags": "leak",
          "source": "https://bsky.app/profile/hackread.bsky.social/post/3mayg3byzls2e"
        },
        {
          "timestamp": "2025-12-27T14:42:36.000Z",
          "entities": "Trust Wallet Chrome Extension Supply Chain Attack",
          "eventSummary": "The Trust Wallet Chrome extension version 2.68 was compromised in a supply chain attack involving malicious code that exfiltrated seed phrases and drained approximately $7 million from users. Trust Wallet has since launched a compensation process for the victims.",
          "severity": "High",
          "tags": "hack",
          "source": "https://cryptoslate.com/how-browser-extensions-expose-your-crypto-to-a-fatal-design-flaw-that-the-industry-ignored-bleeding-713m-in-2025"
        }
      ],
      "overallDayThreatScore": 92,
      "dailyBrief": "Today saw a spike in severe cyber incidents across financial, media, and crypto sectors. Major banks issued breach alerts due to a third-party compromise, Condé Nast faced an unprecedented data leak affecting tens of millions, and Trust Wallet's browser extension suffered a damaging supply chain attack resulting in significant financial loss. The trend highlights escalating risks from third-party integrations and supply chain vulnerabilities, with attackers targeting both personal data and financial assets at scale."
    },
    {
      "date": "2025-12-29",
      "events": [
        {
          "timestamp": "2025-12-28T14:48:44.000Z",
          "entities": "Qilin breach of Atalian",
          "eventSummary": "The Qilin hacking group claims to have breached the French service company Atalian, allegedly exfiltrating 500 GB of data. Samples of the stolen data have been provided as proof of the breach.",
          "severity": "High",
          "tags": "breach",
          "source": "https://bsky.app/profile/hackmanac.com/post/3mb2ih6f6w32"
        },
        {
          "timestamp": "2025-12-28T04:58:32.000Z",
          "entities": "WIRED/Condé Nast subscriber data leak",
          "eventSummary": "A database containing personal details of over 2.3 million WIRED subscribers was reportedly leaked on BreachForums. The breach, confirmed by Hudson Rock, is part of a larger attack on Condé Nast that may compromise up to 40 million records across various properties.",
          "severity": "High",
          "tags": "leak",
          "source": "https://twitter.com/877710712734232576/status/2005141294486536581"
        },
        {
          "timestamp": "2025-12-28T03:42:10.000Z",
          "entities": "Trust Wallet browser extension breach",
          "eventSummary": "Trust Wallet has enhanced its security measures following a breach involving its browser extension.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://cryptopanic.com/news/28303882/Trust-Wallet-Bolsters-Security-Amid-Browser-Extension-Breach"
        }
      ],
      "overallDayThreatScore": 90,
      "dailyBrief": "Today's cyber landscape is marked by two major breaches with significant data exposure: Qilin's breach of Atalian with 500 GB exfiltrated, and the leak of over 2.3 million WIRED subscriber records, part of a larger Condé Nast compromise. Trust Wallet's response to its browser extension breach highlights ongoing threats to crypto platforms. The day reflects heightened risk, especially for large organizations and digital service providers, with data leaks and breaches as dominant trends."
    },
    {
      "date": "2025-12-30",
      "events": [
        {
          "timestamp": "2025-12-29T13:21:24.000Z",
          "entities": "Trust Wallet Christmas Day Exploit – 2,596 Addresses Compromised",
          "eventSummary": "Trust Wallet has identified 2,596 compromised addresses after a Christmas Day exploit. The company is currently moving into a verification phase to distinguish legitimate victims from false claims.",
          "severity": "High",
          "tags": "exploit",
          "source": "https://cointelegraph.com/news/trust-wallet-verification-phase-false-claims-hack"
        },
        {
          "timestamp": "2025-12-29T12:22:23.000Z",
          "entities": "Mens Den Data Breach – User Information Exposed",
          "eventSummary": "US-based entity Mens Den reportedly suffered a data breach. The leaked database allegedly contains user email addresses, password hashes, and personal profile information.",
          "severity": "Medium",
          "tags": "breach",
          "source": "https://twitter.com/1507666230102138882/status/2005615380694278290"
        },
        {
          "timestamp": "2025-12-29T12:21:07.000Z",
          "entities": "Ubisoft Source Code Leak Claims – Unverified",
          "eventSummary": "Reports indicate that a breach at Ubisoft involving the injection of massive amounts of in-game currency may be exaggerated. While hacker groups claim to have leaked 900 GB of source code and internal documentation, no evidence has been provided to verify these claims.",
          "severity": "Medium",
          "tags": "leak",
          "source": "https://www.reddit.com/r/cybersecurity/comments/1pyhnld/ubisoft_hack_is_reportedly_blown_way_out_of"
        },
        {
          "timestamp": "2025-12-29T10:47:42.000Z",
          "entities": "Omrania Ransomware Breach – 400 GB Data Exfiltrated",
          "eventSummary": "The Omrania INC Ransom group claims to have breached Saudi Arabian firm Omrania, allegedly exfiltrating 400 GB of sensitive data. The stolen information reportedly includes confidential documents, client data, financial records, and project drawings.",
          "severity": "High",
          "tags": "breach",
          "source": "https://twitter.com/190389182/status/2005591551020343622"
        },
        {
          "timestamp": "2025-12-29T09:46:33.000Z",
          "entities": "npm Package Phishing Campaign – Industrial & Healthcare Targeted",
          "eventSummary": "Attackers utilized 27 npm packages as CDN-hosted phishing lures over a five-month period. These packages mimicked Microsoft sign-in and document-sharing pages to target sales staff at 25 industrial and healthcare companies.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://twitter.com/209811713/status/2005576160407863561"
        }
      ],
      "overallDayThreatScore": 82,
      "dailyBrief": "A high-threat day with several significant cyber events reported. Trust Wallet and Omrania both suffered high-severity breaches, with thousands of users and large amounts of sensitive data impacted. Ongoing phishing campaigns via npm packages targeted industrial and healthcare sectors, while Mens Den and Ubisoft experienced medium-severity incidents. The volume and diversity of attacks suggest increased activity by threat actors, especially targeting financial, gaming, and critical infrastructure organizations."
    },
    {
      "date": "2025-12-31",
      "events": [
        {
          "timestamp": "2025-12-30T21:19:53.000Z",
          "entities": "ErrTraffic ClickFix Attack Automation Tool",
          "eventSummary": "A new cybercrime tool named ErrTraffic has been identified, allowing threat actors to automate ClickFix attacks by generating fake browser glitches on compromised websites to deliver malicious payloads.",
          "severity": "High",
          "tags": "hack",
          "source": "https://bsky.app/profile/bleepingcomputer.com/post/3mbab3xcveq2z"
        },
        {
          "timestamp": "2025-12-30T19:37:21.000Z",
          "entities": "Trust Wallet Chrome Extension Exploit Compensation",
          "eventSummary": "Trust Wallet has begun compensating users affected by a security exploit targeting its Chrome browser extension.",
          "severity": "Medium",
          "tags": "exploit",
          "source": "https://cryptopanic.com/news/28378778/Trust-Wallet-Compensates-Users-After-Chrome-Extension-Exploit"
        },
        {
          "timestamp": "2025-12-30T12:13:29.000Z",
          "entities": "Unleash Protocol Multisig Exploit & Governance Failure",
          "eventSummary": "Unleash Protocol halted all on-chain activities following a multisig exploit and governance failure that led to a hack. Reports indicate the incident is part of a growing trend of DeFi-related scams.",
          "severity": "High",
          "tags": "hack",
          "source": "https://u.today/scam-alert-unleash-protocol-faces-multisig-exploit"
        },
        {
          "timestamp": "2025-12-30T10:48:33.000Z",
          "entities": "Silver Fox ValleyRAT Phishing Operation India",
          "eventSummary": "The threat actor Silver Fox has shifted active phishing operations toward India, utilizing income tax lures to deploy the modular ValleyRAT. The attack leverages DLL sideloading in legitimate Windows software to gain persistent access for credential theft.",
          "severity": "Medium",
          "tags": "scam",
          "source": "https://twitter.com/209811713/status/2005954151034019860"
        }
      ],
      "overallDayThreatScore": 85,
      "dailyBrief": "The day saw a significant spike in targeted cyber attacks and exploits, particularly in the DeFi and browser extension sectors. ErrTraffic introduces a new automated tool for delivering malicious payloads via fake browser glitches, while Unleash Protocol faced a critical multisig exploit, halting all operations. Trust Wallet responded proactively by compensating victims of a Chrome extension breach. Silver Fox's phishing campaign targeting Indian users via ValleyRAT highlights the threat actor’s evolving tactics. The overall threat environment is elevated, with DeFi and credential theft as dominant concerns."
    }
  ]
}